ServiceInteractions/riv/processdevelopment/infections/trunk/Schema/schemas/interactions/ProcessLaboratoryReportInteraction/ProcessLaboratoryReportInteraction_1.0_RIVTABP20.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. The ASF licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='ProcessLaboratoryReportInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:wsa='http://www.w3.org/2005/08/addressing' xmlns:tjsr='urn:riv:processdevelopment:infections:ProcessLaboratoryReportResponder:1' xmlns:tjsi='urn:riv:processdevelopment:infections:ProcessLaboratoryReportInitiator:1' xmlns:tns='urn:riv:processdevelopment:infections:ProcessLaboratoryReport:1:rivtabp20' targetNamespace='urn:riv:processdevelopment:infections:ProcessLaboratoryReport:1:rivtabp20'>
  <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: ProcessLaboratoryReportInteraction
			 Beskrivning: 
			   Submission of laboratory report information to Infektionsverktyget
			 Revisioner: 
			 Tjänstedomän: processdevelopment:infections
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP20
			 Förvaltas av: xxx
			 </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:processdevelopment:infections:ProcessLaboratoryReportResponder:1:rivtabp20'>
      <xs:import schemaLocation='ProcessLaboratoryReportResponder_1.0.xsd' namespace='urn:riv:processdevelopment:infections:ProcessLaboratoryReportResponder:1' />
      <xs:import schemaLocation='../../core_components/ws-addressing-1.0.xsd' namespace='http://www.w3.org/2005/08/addressing' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='ProcessLaboratoryReportRequest'>
    <wsdl:part name='LogicalAddress' element='wsa:To'>
      <xs:annotation>
        <xs:documentation>The HSAId for Vårdgivare</xs:documentation>
      </xs:annotation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:ProcessLaboratoryReport' />
  </wsdl:message>
  <wsdl:message name='ProcessLaboratoryReportResponse'>
    <wsdl:part name='parameters' element='tjsr:ProcessLaboratoryReportResponse' />
  </wsdl:message>
  <wsdl:portType name='ProcessLaboratoryReportResponderInterface'>
    <wsdl:operation name='ProcessLaboratoryReport'>
      <wsdl:input message='tns:ProcessLaboratoryReportRequest' />
      <wsdl:output message='tns:ProcessLaboratoryReportResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='ProcessLaboratoryReportResponderBinding' type='tns:ProcessLaboratoryReportResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='ProcessLaboratoryReport'>
      <soap:operation soapAction='urn:riv:processdevelopment:infections:ProcessLaboratoryReportResponder:1:ProcessLaboratoryReport' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:ProcessLaboratoryReportRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='ProcessLaboratoryReportResponderService'>
    <wsdl:port name='ProcessLaboratoryReportResponderPort' binding='tns:ProcessLaboratoryReportResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>