ServiceInteractions/riv/processdevelopment/infections/trunk/ProcessLaboratoryReport/Virtualisering/src/main/resources/schemas/interactions/ProcessLaboratoryReportInteraction/Mall LaboratoryReport.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:processdevelopment:infections:ProcessLaboratoryReportResponder:1" xmlns:urn1="urn:riv:processdevelopment:infections:1:LaboratoryReport" xmlns:oe="http://schemas.openehr.org/v1" xmlns:v1="http://schemas.openehr.org/v1">
   <soapenv:Header>
      <add:To>$$logical_address</add:To>
   </soapenv:Header>
   <soapenv:Body>
<urn:ProcessLaboratoryReport>
<urn1:Laboratoriesvar template_id="Laboratoriesvar" archetype_node_id="openEHR-EHR-COMPOSITION.laboratory_report.v1" type="COMPOSITION" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

	<urn1:name>
		<urn1:value>Laboratoriesvar</urn1:value>
	</urn1:name>
	<urn1:uid xsi:type="oe:HIER_OBJECT_ID">
		<oe:value>1.2.752.129.2.1.2.1::$$svarsid</oe:value>
	</urn1:uid>
	<urn1:language>
		<urn1:terminology_id>
			<urn1:value>ISO_639-1</urn1:value>
		</urn1:terminology_id>
		<urn1:code_string>sv</urn1:code_string>
	</urn1:language>
	<urn1:territory>
		<urn1:terminology_id>
			<urn1:value>ISO_3166-1</urn1:value>
		</urn1:terminology_id>
		<urn1:code_string>SE</urn1:code_string>
	</urn1:territory>
	<urn1:category>
		<urn1:value>event</urn1:value>
		<urn1:defining_code>
			<urn1:terminology_id>
				<urn1:value>openehr</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>433</urn1:code_string>
		</urn1:defining_code>
	</urn1:category>
	<urn1:composer xsi:type="oe:PARTY_IDENTIFIED"/>
	<urn1:context other_context_type="ITEM_TREE" other_context_node_id="at0001">
		<urn1:start_time>
			<oe:value>$$provtagningstidpunkt</oe:value>
		</urn1:start_time>
		<urn1:setting>
			<oe:value>secondary medical care</oe:value>
			<oe:defining_code>
				<oe:terminology_id>
					<oe:value>openehr</oe:value>
				</oe:terminology_id>
				<oe:code_string>232</oe:code_string>
			</oe:defining_code>
		</urn1:setting>
		<urn1:participations>
			<oe:function>
				<oe:value>Beställande enhet</oe:value>
			</oe:function>
			<oe:performer xsi:type="oe:PARTY_IDENTIFIED">
				<oe:identifiers>
					<oe:issuer>CeHis</oe:issuer>
					<oe:assigner>$$vårdgivare</oe:assigner>
					<oe:id>$$registrerande enhet</oe:id>
					<oe:type>1.2.752.129.2.1.4.1</oe:type>
				</oe:identifiers>
			</oe:performer>
			<oe:mode>
				<oe:value>Beställande enhet</oe:value>
				<oe:defining_code>
					<oe:terminology_id>
						<oe:value>1.2.752.129.2.2.2.42</oe:value>
					</oe:terminology_id>
					<oe:code_string>1</oe:code_string>
				</oe:defining_code>
			</oe:mode>
		</urn1:participations>
	</urn1:context>
	<urn1:Provtagning archetype_node_id="openEHR-EHR-ACTION.activity_changing_event.v1" type="ACTION">
		<urn1:name>
			<urn1:value>Provtagning</urn1:value>
		</urn1:name>
		<urn1:language>
			<urn1:terminology_id>
				<urn1:value>ISO_639-1</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>sv</urn1:code_string>
		</urn1:language>
		<urn1:encoding>
			<urn1:terminology_id>
				<urn1:value>IANA_character-sets</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>ISO646-SE</urn1:code_string>
		</urn1:encoding>
		<urn1:subject xsi:type="oe:PARTY_SELF">
		</urn1:subject>
		<urn1:time>
			<oe:value>$$provtagningstidpunkt</oe:value>
		</urn1:time>
		<urn1:Admininfo_aktivitetsmoment archetype_node_id="openEHR-EHR-CLUSTER.admin_activity_changing_event.v1" type="CLUSTER">
			<urn1:name>
				<urn1:value>Admininfo aktivitetsmoment</urn1:value>
			</urn1:name>
			<urn1:aktivitetskod archetype_node_id="at0001" valueType="DV_CODED_TEXT">
				<urn1:name>
					<urn1:value>aktivitetskod</urn1:value>
				</urn1:name>
				<urn1:value>
					<oe:value></oe:value>
					<oe:defining_code>
						<oe:terminology_id>
							<oe:value>1.2.752.116.2.1.1</oe:value>
						</oe:terminology_id>
						<oe:code_string>17636008</oe:code_string>
					</oe:defining_code>
				</urn1:value>
			</urn1:aktivitetskod>
		</urn1:Admininfo_aktivitetsmoment>
		<urn1:ism_transition>
			<urn1:current_state>
				<oe:value>completed</oe:value>
				<oe:defining_code>
					<oe:terminology_id>
						<oe:value>openehr</oe:value>
					</oe:terminology_id>
					<oe:code_string>532</oe:code_string>
				</oe:defining_code>
			</urn1:current_state>
		</urn1:ism_transition>
	</urn1:Provtagning>
	<urn1:Mikrobiologiskt_fynd archetype_node_id="openEHR-EHR-OBSERVATION.observed_condition.v1" type="OBSERVATION">
		<urn1:name>
			<urn1:value>Mikrobiologiskt fynd</urn1:value>
		</urn1:name>
		<urn1:language>
			<urn1:terminology_id>
				<urn1:value>ISO_639-1</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>sv</urn1:code_string>
		</urn1:language>
		<urn1:encoding>
			<urn1:terminology_id>
				<urn1:value>IANA_character-sets</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>ISO646-SE</urn1:code_string>
		</urn1:encoding>
		<urn1:subject xsi:type="oe:PARTY_SELF">
		</urn1:subject>
		<urn1:data archetype_node_id="at0001">
			<urn1:vilken_handelse_som_helst archetype_node_id="at0002" type="POINT_EVENT">
				<urn1:name>
					<urn1:value>Mikrobiologisk undersökning</urn1:value>
				</urn1:name>
				<urn1:time>
					<oe:value>$$observationstidpunkt</oe:value>
				</urn1:time>
				<urn1:data archetype_node_id="at0003" type="ITEM_TREE">
					<urn1:Mikrobiologisk_organism archetype_node_id="openEHR-EHR-CLUSTER.microbial_organism.v1" type="CLUSTER">
						<urn1:name>
							<urn1:value>Mikrobiologisk organism</urn1:value>
						</urn1:name>
						<urn1:agenskod archetype_node_id="at0001" type="ELEMENT" valueType="DV_CODED_TEXT">
							<urn1:name>
								<urn1:value>agenskod</urn1:value>
							</urn1:name>
							<urn1:value>
								<oe:value></oe:value>
								<oe:defining_code>
									<oe:terminology_id>
										<oe:value>1.2.752.108.1</oe:value>
									</oe:terminology_id>
									<oe:code_string>$$agenskod</oe:code_string>
								</oe:defining_code>
							</urn1:value>
						</urn1:agenskod>
					</urn1:Mikrobiologisk_organism>
				</urn1:data>
			</urn1:vilken_handelse_som_helst>
		</urn1:data>
	</urn1:Mikrobiologiskt_fynd>
	<urn1:Patient archetype_node_id="openEHR-EHR-ADMIN_ENTRY.patient.v1" type="ADMIN_ENTRY">
		<urn1:name>
			<urn1:value>Patient</urn1:value>
		</urn1:name>
		<urn1:language>
			<urn1:terminology_id>
				<urn1:value>ISO_639-1</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>sv</urn1:code_string>
		</urn1:language>
		<urn1:encoding>
			<urn1:terminology_id>
				<urn1:value>IANA_character-sets</urn1:value>
			</urn1:terminology_id>
			<urn1:code_string>ISO646-SE</urn1:code_string>
		</urn1:encoding>
		<urn1:subject xsi:type="oe:PARTY_SELF">
		</urn1:subject>
		<urn1:data archetype_node_id="at0001" type="ITEM_TREE">
			<urn1:person_-_id archetype_node_id="at0002" type="ELEMENT" valueType="DV_IDENTIFIER">
				<urn1:name>
					<urn1:value>person-id</urn1:value>
				</urn1:name>
				<urn1:value>
					<oe:issuer>$$issuer_personid</oe:issuer>
					<oe:assigner>$$assigner_personid</oe:assigner>
					<oe:id>$$personid</oe:id>
					<oe:type>$$oid_personid</oe:type>		
				</urn1:value>
			</urn1:person_-_id>
			<urn1:fodelsetidpunkt archetype_node_id="at0003" type="ELEMENT" valueType="DV_DATE_TIME">
				<urn1:name>
					<urn1:value>födelsetidpunkt</urn1:value>
				</urn1:name>
				<urn1:value>
					<oe:value>$$födelsetidpunkt</oe:value>
				</urn1:value>
			</urn1:fodelsetidpunkt>
			<urn1:kon archetype_node_id="at0004" type="ELEMENT" valueType="DV_CODED_TEXT">
				<urn1:name>
					<urn1:value>kön</urn1:value>
				</urn1:name>
				<urn1:value>
					<oe:value></oe:value>
					<oe:defining_code>
						<oe:terminology_id>
							<oe:value>1.2.752.129.2.2.1.1</oe:value>
						</oe:terminology_id>
						<oe:code_string>$$kön</oe:code_string>
					</oe:defining_code>
				</urn1:value>
			</urn1:kon>
		</urn1:data>
	</urn1:Patient>

</urn1:Laboratoriesvar>
</urn:ProcessLaboratoryReport>

   </soapenv:Body>
</soapenv:Envelope>